# Решение через список
user_month = int(input("Введите месяц в виде целого числа с 1 до 12 \n"))
months = ("Январь", "Ферваль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь",
          "Декабарь")
print(months[user_month - 1])

# Решение через словарь
user_month_dict = int(input("Введите месяц в виде целого числа с 1 до 12 \n"))
months_dict = {1: "Январь", 2: "Ферваль", 3: "Март", 4: "Апрель", 5: "Май", 6: "Июнь", 7: "Июль", 8: "Август",
               9: "Сентябрь", 10: "Октябрь", 11: "Ноябрь", 12: "Декабарь"}
print(months_dict.get(user_month_dict))
